
{
  "AboutMeTitle": "Sobre mí",
  "AboutOresteHeading": "Sobre Oreste",
  "AboutOresteDescription1": "Soy Oreste Twizeyimana, un Desarrollador de Programas con 2 años de experiencia construyendo soluciones de software que son tanto elegantes como efectivas. Mi experiencia técnica incluye C#, .NET, Vue.js, y más – vea mi sección de ProgrammingModel para una inmersión más profunda.",
  "AboutOresteDescription2": "Soy un solucionador de problemas dedicado que prospera con el desafío de crear código limpio y bien estructurado. En mi tiempo libre, siempre estoy trabajando en proyectos paralelos y explorando nuevas tecnologías.",
  "AboutOresteDescription3": "También disfruto del modelaje; explore mi portafolio en Instagram [Insertar enlace de Instagram aquí].",
  "ContactTitle": "Contacto",
  "LetsConnectHeading": "Conectemos",
  "ContactFormDescription": "Por favor, use este formulario para contactarnos con cualquier pregunta o comentario:",
  "YourNameLabel": "Tu nombre:",
  "EmailLabel": "Correo electrónico:",
  "MessageLabel": "Mensaje:",
  "SendButton": "Enviar",
  "HomePageTitle": "Página principal",
  "CraftingTechnicalSolutionsHeading": "Creando soluciones técnicas con un toque multilingüe",
  "FromCodeToCommunicationSubheading": "Desde el código hasta la comunicación, dando forma a tu visión",
  "WelcomeToMyPortfolio": "¡Hola, bienvenido a mi portafolio OC!",
  "InterestInMyWork": "Gracias por interesarte en mi trabajo. Esta página sirve como una muestra completa de mis estilos de programación, habilidades y perfil general. Soy un desarrollador apasionado, experto en crear soluciones técnicas que no solo son funcionales, sino también lingüísticamente correctas.",
  "DownloadCV": "Descarga mi CV para saber más sobre mi experiencia y habilidades.",
  "ShapingYourVision": "Desde el código hasta la comunicación, dando forma a tu visión. Soy Oreste TWIZEYIMANA, un Desarrollador de Programas con {0} años de experiencia en el campo. Me apasiona crear soluciones de software innovadoras y fáciles de usar.",
  "SeekingCollaboration": "Ya sea que estés buscando un programador experto para colaborar, valiosos consejos sobre un proyecto, o simplemente tengas una consulta, no dudes en contactarme. Siempre estoy feliz de conectar y discutir posibles oportunidades.",
  "LanguagesTitle": "Idiomas",
  "LanguagesDescription": "Tengo una sólida base en comunicación multilingüe, incluyendo dominio nativo en tres idiomas y fluidez en otro. Además, tengo una experiencia considerable en la tutoría de inglés y francés.",
  "LanguageProficiencyHeading": "Dominio del idioma",
  "EnglishProficiency": "Inglés: Hablante nativo",
  "FrenchProficiency": "Francés: Hablante nativo",
  "KinyarwandaProficiency": "Kinyarwanda: Hablante nativo",
  "PolishProficiency": "Polaco: Fluido",
  "TutoringExperienceHeading": "Experiencia en tutoría",
  "TutoringExperienceDescription": "Tengo una amplia experiencia en la tutoría de estudiantes de todas las edades y habilidades. He ayudado a estudiantes de primaria con inglés, a estudiantes de secundaria con inglés, francés y matemáticas, y a adultos que buscan mejorar su francés conversacional o prepararse para el examen IELTS. Mi experiencia incluye inglés de negocios para profesionales, lecciones personalizadas para jóvenes estudiantes y preparación de exámenes para estudiantes que enfrentan evaluaciones importantes. Me enorgullezco de adaptar mis métodos de enseñanza a las necesidades individuales de cada estudiante, ayudándolos a alcanzar sus objetivos únicos de idioma y académicos.",
  "MyServicesHeading": "Mis servicios",
  "MyServicesDescription": "Ofrezco una variedad de servicios de aprendizaje de idiomas, incluyendo:",
  "OneOnOneTutoring": "Tutoría individual",
  "GroupClasses": "Clases grupales",
  "OnlineTutoring": "Tutoría en línea",
  "ExamPreparation": "Preparación de exámenes",
  "ConversationPractice": "Práctica de conversación",
  "TranslationServices": "También estoy disponible para servicios de traducción e interpretación.",
  "MyApproachHeading": "Mi enfoque",
  "MyApproachDescription": "Creo que el aprendizaje de idiomas debe ser divertido y atractivo. Adapto mis lecciones a las necesidades individuales de cada estudiante y utilizo una variedad de métodos para mantener a mis estudiantes motivados. Soy paciente y alentador, y siempre estoy dispuesto a responder preguntas.",
  "TestimonialsHeading": "Testimonios",
  "Testimonial1": "¡Gran maestro! Buen ambiente y enfoque profesional hacia el estudiante. - Jaroslaw",
  "Testimonial2": "Muy buena cooperación. Estamos satisfechos con las lecciones. - Katarzyna",
  "MoreTestimonialsLink": "Ver más testimonios en mi perfil de Buki.org.pl",
  "ContactMeHeading": "Contáctame",
  "ContactMeDescription": "¿Interesado en mejorar tus habilidades lingüísticas? ¡Conectemos!",
  "ProgrammingTitle": "Habilidades de ProgrammingModel",
  "ProgrammingJourneyHeading": "Mi viaje de programación",
  "ProgrammingJourneyDescription": "Como desarrollador .NET apasionado y experimentado con una sólida experiencia en la construcción y despliegue de aplicaciones backend robustas. A lo largo de más de 2 años en la industria, he perfeccionado mis habilidades en diversas tecnologías y metodologías, lo que me permite contribuir eficazmente a proyectos complejos y ofrecer soluciones de alta calidad.",
  "TechnologiesHeading": "Tecnologías",
  "TechnicalExpertiseHeading": "Experiencia técnica",
  "TechnicalExpertiseDescription": "Mi experiencia abarca un espectro de tecnologías y herramientas:",
  "CSharpSkill": "C# (.NET): Experto en el desarrollo de aplicaciones escalables utilizando C# y el marco .NET.",
  "WPFSkill": "WPF: Hábil en la creación de aplicaciones de escritorio ricas con WPF.",
  "EntityFrameworkSkill": "Entity Framework: Experto en la interacción con bases de datos y ORM utilizando Entity Framework.",
  "SQLSkill": "SQL: Experto en diseño, consulta y optimización de bases de datos utilizando SQL.",
  "GitSkill": "Git: Experto en control de versiones y flujos de trabajo de desarrollo colaborativo utilizando Git.",
  "CI_CDPracticesSkill": "Prácticas de CI/CD: Experto en prácticas de Integración Continua y Despliegue Continuo.",
  "HTML_CSSSkill": "HTML/CSS: Familiarizado con tecnologías front-end para la creación de interfaces de usuario.",
  "VueJSSkill": "Vue.js: Conocedor en el desarrollo de aplicaciones web dinámicas utilizando Vue.js.",
  "AgileScrumSkill": "Agile/Scrum: Experto en prácticas ágiles para una gestión de proyectos eficiente.",
  "AlwaysLearningDescription": "Siempre estoy aprendiendo y experimentando. Si tienes un proyecto en mente, o simplemente quieres conectar, ¡conectemos! También siéntete libre de descargar mi CV para saber más sobre mi experiencia y habilidades.",
  "FeaturedProjectsHeading": "Proyectos destacados",
  "RTTrackersProject": "RT Trackers",
  "RTTrackersDescription": "El repositorio stere8/rttrackers es una aplicación web basada en Flask diseñada para rastrear precios de acciones y condiciones meteorológicas. Aquí hay un resumen de sus componentes y funcionalidades clave:",
  "CoreFunctionalitiesHeading": "Funcionalidades principales",
  "StockTracking": "Rastreo de acciones: Utiliza dos clases, StockTracker y StockTracker2, para obtener precios actuales de acciones de diferentes APIs (Alpha Vantage y posiblemente IEX Cloud). Estas clases están definidas en stock_trackers.py y stock_trackers2.py.",
  "WeatherTracking": "Rastreo meteorológico: La clase WeatherTracker en weather_tracker.py obtiene datos meteorológicos actuales, incluyendo humedad, presión, velocidad del viento y temperatura, utilizando la API de OpenWeatherMap.",
  "WebApplicationStructureHeading": "Estructura de la aplicación web",
  "FlaskApp": "Aplicación Flask: La lógica principal de la aplicación se encuentra en app.py, que define rutas para diferentes funcionalidades como mostrar la página de inicio, rastrear acciones seleccionadas, seleccionar acciones, seleccionar regiones para el rastreo meteorológico y rastrear condiciones meteorológicas en regiones seleccionadas.",
  "HTMLTemplates": "Plantillas HTML: El directorio templates contiene archivos HTML (index.html, selectstocks.html, stocktracker.html y otros) para renderizar las páginas web. Estas plantillas utilizan Bootstrap y jQuery para el estilo y la funcionalidad.",
  "StockRepresentation": "Representación de acciones: La clase Stock en Stock.py representa una acción con atributos como nombre, ticker y último precio.",
  "ConfigurationAndManagementHeading": "Configuración y gestión",
  "Gitignore": ".gitignore: Especifica archivos y directorios que Git debe ignorar, incluyendo resultados de compilación, archivos específicos del usuario y otros archivos que no son código fuente.",
  "Gitattributes": ".gitattributes: Configura ajustes de Git para manejar finales de línea, diferencias en ciertos tipos de archivos y gestionar comportamientos de fusión para tipos de archivos específicos.",
  "EnhancementsToStockTrackingHeading": "Mejoras en el rastreo de acciones",
  "RealTimeUpdates": "Actualizaciones en tiempo real: Implementar WebSocket o sondeo AJAX para proporcionar actualizaciones en tiempo real de los precios de las acciones sin necesidad de actualizar la página.",
  "ExpandedAPIIntegration": "Integración ampliada de API: Integrar más APIs de datos financieros para proporcionar una gama más amplia de datos del mercado de valores, incluyendo mercados internacionales.",
  "UserCustomization": "Personalización del usuario: Permitir a los usuarios guardar sus selecciones de acciones y verlas al regresar al sitio, posiblemente a través de cuentas de usuario o almacenamiento local.",
  "EnhancementsToWeatherTrackingHeading": "Mejoras en el rastreo meteorológico",
  "ExtendedForecast": "Pronóstico extendido: Incorporar una función de pronóstico meteorológico de 5 días o 10 días además de las condiciones meteorológicas actuales.",
  "GeolocationSupport": "Soporte de geolocalización: Detectar automáticamente la ubicación del usuario para mostrar información meteorológica local sin necesidad de selección manual de la región.",
  "WeatherAlerts": "Alertas meteorológicas: Implementar alertas o advertencias meteorológicas basadas en condiciones meteorológicas severas en las regiones seleccionadas.",
  "UI_UXImprovementsHeading": "Mejoras en la UI/UX",
  "ResponsiveDesign": "Diseño responsivo: Asegurar que la aplicación web sea completamente responsiva y proporcione una experiencia de visualización óptima en todos los dispositivos.",
  "InteractiveCharts": "Integrar gráficos interactivos para el historial de precios de acciones y patrones meteorológicos utilizando bibliotecas como Chart.js o D3.js.",
  "ThemeCustomization": "Ofrecer opciones de personalización de temas para los usuarios, como modo claro y modo oscuro.",
  "DreamNDineProject": "DreamNDine",
  "DreamNDineDescription": "El stere8/dreamndine es una aplicación web integral...",
  "PythonExplorationsProject": "Exploraciones en Python",
  "PythonExplorationsDescription": "Esta colección de proyectos de Python para principiantes fue un punto de partida fantástico para desarrollar mis habilidades de programación básicas...",
  "CrossPlatformTodoAppProject": "Aplicación de tareas multiplataforma",
  "CrossPlatformTodoAppDescription": "Este proyecto de React Native fue mi incursión en el desarrollo móvil...",
  "RobustUserAuthenticationSystemProject": "Sistema robusto de autenticación de usuarios",
  "RobustUserAuthenticationSystemDescription": "Este proyecto integral demuestra mi capacidad para diseñar sistemas de autenticación seguros y escalables para aplicaciones web...",
  "Skills": {
    "Development": [
      "C# (.NET)",
      "ASP.NET",
      "WPF",
      "Entity Framework",
      "SQL",
      "Git",
      "Prácticas de CI/CD",
      "HTML",
      "CSS",
      "Vue.js"
    ],
    "Process Improvement": [
      "Automatización",
      "Optimización",
      "Integración",
      "Optimización",
      "Metodologías Agile/Scrum"
    ],
    "Problem Solving": [
      "Depuración",
      "Revisión de código",
      "Escritura de código limpio",
      "Documentación de proyectos"
    ],
    "Customer Focus": [
      "Mejora de experiencias del cliente a través de procesos optimizados y aplicaciones mejoradas"
    ],
    "Adaptability": [
      "Aprendizaje rápido",
      "Abierto a nuevas tecnologías"
    ],
    "Soft Skills": [
      "Dedicación",
      "Trabajo duro",
      "Trabajo en equipo"
    ]
  }
}